vanvught/GD32F407RE-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
extern "C" {
void TIMER1_IRQHandler() {
	/*
	 * USART 0
	 */
#if defined (DMX_USE_USART0)
	if ((TIMER_INTF(TIMER1) & TIMER_INT_FLAG_CH0) == TIMER_INT_FLAG_CH0) {
		switch (s_TxBuffer[dmx::config::USART0_PORT].State) {
		case TxRxState::DMXINTER:
			_gpio_mode_output(USART0_GPIO_PORT, USART0_TX_PIN);
			GPIO_BC(USART0_GPIO_PORT) = USART0_TX_PIN;
			s_TxBuffer[dmx::config::USART0_PORT].State = TxRxState::BREAK;
			timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_0, TIMER_CNT(TIMER1) + s_nDmxTransmitBreakTime);
			break;
		case TxRxState::BREAK:
			_gpio_mode_af(USART0_GPIO_PORT, USART0_TX_PIN, USART0);
			s_TxBuffer[dmx::config::USART0_PORT].State = TxRxState::MAB;
			timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_0, TIMER_CNT(TIMER1) + s_nDmxTransmitMabTime);
			break;
		case TxRxState::MAB: {
			uint32_t dmaCHCTL = DMA_CHCTL(USART0_DMA, USART0_TX_DMA_CH);
			dmaCHCTL &= ~DMA_CHXCTL_CHEN;
			DMA_CHCTL(USART0_DMA, USART0_TX_DMA_CH) = dmaCHCTL;
			dma_interrupt_flag_clear(USART0_DMA, USART0_TX_DMA_CH, DMA_INTF_FTFIF);
			DMA_CHMADDR(USART0_DMA, USART0_TX_DMA_CH) = (uint32_t) s_TxBuffer[dmx::config::USART0_PORT].data;
			DMA_CHCNT(USART0_DMA, USART0_TX_DMA_CH) = (s_TxBuffer[dmx::config::USART0_PORT].nLength & DMA_CHXCNT_CNT);
			dmaCHCTL |= DMA_CHXCTL_CHEN;
			dmaCHCTL |= DMA_INTERRUPT_ENABLE;
			DMA_CHCTL(USART0_DMA, USART0_TX_DMA_CH) = dmaCHCTL;
			usart_dma_transmit_config(USART0, USART_DENT_ENABLE);
		}
			break;
		default:
			break;
		}

		timer_interrupt_flag_clear(TIMER1, TIMER_INT_FLAG_CH0);
		return;
	}
#endif
	/*
	 * USART 1
	 */
#if defined (DMX_USE_USART1)
	if ((TIMER_INTF(TIMER1) & TIMER_INT_FLAG_CH1) == TIMER_INT_FLAG_CH1) {
		switch (s_TxBuffer[dmx::config::USART1_PORT].State) {
		case TxRxState::DMXINTER:
			_gpio_mode_output(USART1_GPIO_PORT, USART1_TX_PIN);
			GPIO_BC(USART1_GPIO_PORT) = USART1_TX_PIN;
			s_TxBuffer[dmx::config::USART1_PORT].State = TxRxState::BREAK;
			timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_1, TIMER_CNT(TIMER1) + s_nDmxTransmitBreakTime);
			break;
		case TxRxState::BREAK:
			_gpio_mode_af(USART1_GPIO_PORT, USART1_TX_PIN, USART1);
			s_TxBuffer[dmx::config::USART1_PORT].State = TxRxState::MAB;
			timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_1, TIMER_CNT(TIMER1) + s_nDmxTransmitMabTime);
			break;
		case TxRxState::MAB: {
			uint32_t dmaCHCTL = DMA_CHCTL(USART1_DMA, USART1_TX_DMA_CH);
			dmaCHCTL &= ~DMA_CHXCTL_CHEN;
			DMA_CHCTL(USART1_DMA, USART1_TX_DMA_CH) = dmaCHCTL;
			dma_interrupt_flag_clear(USART1_DMA, USART1_TX_DMA_CH, DMA_INTF_FTFIF);
			DMA_CHMADDR(USART1_DMA, USART1_TX_DMA_CH) = (uint32_t) s_TxBuffer[dmx::config::USART1_PORT].data;
			DMA_CHCNT(USART1_DMA, USART1_TX_DMA_CH) = (s_TxBuffer[dmx::config::USART1_PORT].nLength & DMA_CHXCNT_CNT);
			dmaCHCTL |= DMA_CHXCTL_CHEN;
			dmaCHCTL |= DMA_INTERRUPT_ENABLE;
			DMA_CHCTL(USART1_DMA, USART1_TX_DMA_CH) = dmaCHCTL;
			usart_dma_transmit_config(USART1, USART_DENT_ENABLE);
		}
			break;
		default:
			break;
		}

		timer_interrupt_flag_clear(TIMER1, TIMER_INT_FLAG_CH1);
		return;
	}
#endif
	/*
	 * USART 2
	 */
#if defined (DMX_USE_USART2)
	if ((TIMER_INTF(TIMER1) & TIMER_INT_FLAG_CH2) == TIMER_INT_FLAG_CH2) {
		switch (s_TxBuffer[dmx::config::USART2_PORT].State) {
		case TxRxState::DMXINTER:
			_gpio_mode_output(USART2_GPIO_PORT, USART2_TX_PIN);
			GPIO_BC(USART2_GPIO_PORT) = USART2_TX_PIN;
			timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_2, TIMER_CNT(TIMER1) + s_nDmxTransmitBreakTime);
			s_TxBuffer[dmx::config::USART2_PORT].State = TxRxState::BREAK;
			break;
		case TxRxState::BREAK:
			_gpio_mode_af(USART2_GPIO_PORT, USART2_TX_PIN, USART2);
			timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_2, TIMER_CNT(TIMER1) + s_nDmxTransmitMabTime);
			s_TxBuffer[dmx::config::USART2_PORT].State = TxRxState::MAB;
			break;
		case TxRxState::MAB: {
			uint32_t dmaCHCTL = DMA_CHCTL(USART2_DMA, USART2_TX_DMA_CH);
			dmaCHCTL &= ~DMA_CHXCTL_CHEN;
			DMA_CHCTL(USART2_DMA, USART2_TX_DMA_CH) = dmaCHCTL;
			DMA_CHMADDR(USART2_DMA, USART2_TX_DMA_CH) = (uint32_t) s_TxBuffer[dmx::config::USART2_PORT].data;
			DMA_CHCNT(USART2_DMA, USART2_TX_DMA_CH) = (s_TxBuffer[dmx::config::USART2_PORT].nLength & DMA_CHXCNT_CNT);
			dmaCHCTL |= DMA_CHXCTL_CHEN;
			dmaCHCTL |= DMA_INTERRUPT_ENABLE;
			DMA_CHCTL(USART2_DMA, USART2_TX_DMA_CH) = dmaCHCTL;
			usart_dma_transmit_config(USART2, USART_DENT_ENABLE);
			s_TxBuffer[dmx::config::USART2_PORT].State = TxRxState::DMXDATA;
		}
			break;
		case TxRxState::DMXDATA:
			console_error("DMXDATA:USART2");
			break;
		default:
			break;
		}

		timer_interrupt_flag_clear(TIMER1, TIMER_INT_FLAG_CH2);
		return;
	}
#endif
	/*
	 * UART 3
	 */
#if defined (DMX_USE_UART3)
	if ((TIMER_INTF(TIMER1) & TIMER_INT_FLAG_CH3) == TIMER_INT_FLAG_CH3) {
		switch (s_TxBuffer[dmx::config::UART3_PORT].State) {
		case TxRxState::DMXINTER:
			_gpio_mode_output(UART3_GPIO_PORT, UART3_TX_PIN);
			GPIO_BC(UART3_GPIO_PORT) = UART3_TX_PIN;
			s_TxBuffer[dmx::config::UART3_PORT].State = TxRxState::BREAK;
			timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_3, TIMER_CNT(TIMER1) + s_nDmxTransmitBreakTime);
			break;
		case TxRxState::BREAK:
			_gpio_mode_af(UART3_GPIO_PORT, UART3_TX_PIN, UART3);
			s_TxBuffer[dmx::config::UART3_PORT].State = TxRxState::MAB;
			timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_3, TIMER_CNT(TIMER1) + s_nDmxTransmitMabTime);
			break;
		case TxRxState::MAB: {
			uint32_t dmaCHCTL = DMA_CHCTL(UART3_DMA, UART3_TX_DMA_CH);
			dmaCHCTL &= ~DMA_CHXCTL_CHEN;
			DMA_CHCTL(UART3_DMA, UART3_TX_DMA_CH) = dmaCHCTL;
			dma_interrupt_flag_clear(UART3_DMA, UART3_TX_DMA_CH, DMA_INTF_FTFIF);
			DMA_CHMADDR(UART3_DMA, UART3_TX_DMA_CH) = (uint32_t) s_TxBuffer[dmx::config::UART3_PORT].data;
			DMA_CHCNT(UART3_DMA, UART3_TX_DMA_CH) = (s_TxBuffer[dmx::config::UART3_PORT].nLength & DMA_CHXCNT_CNT);
			dmaCHCTL |= DMA_CHXCTL_CHEN;
			dmaCHCTL |= DMA_INTERRUPT_ENABLE;
			DMA_CHCTL(UART3_DMA, UART3_TX_DMA_CH) = dmaCHCTL;
			usart_dma_transmit_config(UART3, USART_DENT_ENABLE);
		}
			break;
		default:
			break;
		}

